---
kind: method
id: M:Autodesk.Revit.DB.FabricationRodInfo.Dispose
source: html/8a1057b2-3b00-5f5b-793e-4f42588a9e88.htm
---
# Autodesk.Revit.DB.FabricationRodInfo.Dispose Method

Releases all resources used by the FabricationRodInfo

## Syntax (C#)
```csharp
public void Dispose()
```